name: "preprocess"
backend: "python"

input [
  {
    name: "input"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]